### Brewfile - one command, full setup ###

# Taps
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"

# Formulae
brew "antidote"
brew "exa"
brew "fzf"
brew "git"
brew "jenv"
brew "lazygit"
brew "mas"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "python@3.11"
brew "pipx"
brew "python-tk@3.11"
brew "rustup-init"
brew "zsh"

# Casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "discord"
cask "font-cascadia-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "github"
cask "iterm2"
cask "logitech-options"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "sfdx"
cask "spotify"
cask "steam"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

# Mac AppStore Apps
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "ScreenBrush", id: 1233965871

# VSCode Extensions
vscode "aaron-bond.better-comments"
vscode "albert.TabOut"
vscode "ChakrounAnas.turbo-console-log"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "GitHub.github-vscode-theme"
vscode "Gruntfuggly.todo-tree"
vscode "IBM.output-colorizer"
vscode "kamikillerto.vscode-colorize"
vscode "marnix.peacock"
vscode "mgwg.light-pink-theme"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "pnp.polacode"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
